sergev/pic32prog/adapter-mpsse.c
/*
 * Calculate checksum.
 */
static unsigned calculate_crc(unsigned crc, unsigned char *data, unsigned nbytes)
{
    static const unsigned short crc_table [16] = {
        0x0000, 0x1021, 0x2042, 0x3063, 0x4084, 0x50a5, 0x60c6, 0x70e7,
        0x8108, 0x9129, 0xa14a, 0xb16b, 0xc18c, 0xd1ad, 0xe1ce, 0xf1ef,
    };
    unsigned i;

    while (nbytes--) {
        i = (crc >> 12) ^ (*data >> 4);
        crc = crc_table[i & 0x0F] ^ (crc << 4);
        i = (crc >> 12) ^ (*data >> 0);
        crc = crc_table[i & 0x0F] ^ (crc << 4);
        data++;
    }
    return crc & 0xffff;
}

/*
 * Send a packet to USB device.
 */
static void bulk_write(mpsse_adapter_t *a, unsigned char *output, int nbytes)
{
    int bytes_written;

    if (debug_level > 1) {
        int i;
        fprintf(stderr, "usb bulk write %d bytes:", nbytes);
        for (i=0; i<nbytes; i++)
            fprintf(stderr, "%c%02x", i ? '-' : ' ', output[i]);
        fprintf(stderr, "\n");
    }

    int ret = libusb_bulk_transfer(a->usbdev, IN_EP, (unsigned char*) output,
        nbytes, &bytes_written, 1000);

    if (ret != 0) {
        fprintf(stderr, "usb bulk write failed: %d: %s\n",
            ret, libusb_strerror(ret));
        exit(-1);
    }
    if (bytes_written != nbytes)
        fprintf(stderr, "usb bulk written %d bytes of %d",
            bytes_written, nbytes);
}

/*
 * If there are any data in transmit buffer -
 * send them to device.
 */
static void mpsse_flush_output(mpsse_adapter_t *a)
{
    int bytes_read, n;
    unsigned char reply [64];
    uint64_t icspTemp = 0;

    if (a->bytes_to_write <= 0)
        return;

    bulk_write(a, a->output, a->bytes_to_write);
    a->bytes_to_write = 0;
    if (a->bytes_to_read <= 0)
        return;

    /* Get reply. */
    bytes_read = 0;
    while (bytes_read < a->bytes_to_read) {
        int ret = libusb_bulk_transfer(a->usbdev, OUT_EP, (unsigned char*) reply,
            a->bytes_to_read - bytes_read + 2, &n, 2000);
        if (ret != 0) {
            fprintf(stderr, "usb bulk read failed\n");
            exit(-1);
        }
        if (debug_level > 1) {
            if (n != a->bytes_to_read + 2)
                fprintf(stderr, "usb bulk read %d bytes of %d\n",
                    n, a->bytes_to_read - bytes_read + 2);
            else {
                int i;
                fprintf(stderr, "usb bulk read %d bytes:", n);
                for (i=0; i<n; i++)
                    fprintf(stderr, "%c%02x", i ? '-' : ' ', reply[i]);
                fprintf(stderr, "\n");
            }
        }
        if (n > 2) {
            if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)
            {
                /* Copy data. */
                memcpy(a->input + bytes_read, reply + 2, n - 2);
            }
            else{
                /* Else ICSP. Do data reconstruction from the bytes */
                int counter;
                for (counter=2; counter<n; counter++){
                    icspTemp = icspTemp>>1 | ((reply[counter]&0x80) ? (1ULL<<63) : 0);
                }
            }
            bytes_read += n - 2;
        }
    }
    if (INTERFACE_ICSP == a->interface){
        /* Since data is LSB, shift data to far right */
        icspTemp = icspTemp>>((63+1) - a->bytes_to_read);
        memcpy(a->input, &icspTemp, sizeof(uint64_t));        
    }
    if (debug_level > 1) {
        int i;
        fprintf(stderr, "mpsse_flush_output received %d bytes:", a->bytes_to_read);
        for (i=0; i<a->bytes_to_read; i++)
            fprintf(stderr, "%c%02x", i ? '-' : ' ', a->input[i]);
        fprintf(stderr, "\n");
    }
    a->bytes_to_read = 0;
}

/*  Renamed function to mpsse_setPins, since it does more than just reset. 
 *  Now controls state of reset (always SYSRST), LED,
 *  ICSP select and ICSP output enable pins */

static void mpsse_setPins(mpsse_adapter_t *a, int sysrst, int led,
                            int icsp, int icsp_oe, int immediateWrite)
{
    unsigned output    = 0x0008 | a->extra_output;  /* TMS idle high, OE pins etc. */
    unsigned direction = 0x000b | a->dir_control;

    if (sysrst)
        output |= a->sysrst_control;
    if (a->sysrst_inverted)
        output ^= a->sysrst_control;

    if (led)
        output |= a->led_control;
    if (a->led_inverted)
        output ^= a->led_control;

    if (icsp)
        output |= a->icsp_control;
    if (a->icsp_inverted)
        output ^= a->icsp_control;

    if (icsp){
		if (output & a->icsp_oe_control){
            output ^= a->icsp_oe_control; /* Fix for boards that use TMS as OE */
		}
		if (icsp_oe)
		    output |= a->icsp_oe_control;
		if (a->icsp_oe_inverted)
		    output ^= a->icsp_oe_control;
	}

    /* command "set data bits low byte" */
    a->output [a->bytes_to_write++] = 0x80;
    a->output [a->bytes_to_write++] = output;
    a->output [a->bytes_to_write++] = direction;

    /* command "set data bits high byte" */
    a->output [a->bytes_to_write++] = 0x82;
    a->output [a->bytes_to_write++] = output >> 8;
    a->output [a->bytes_to_write++] = direction >> 8;

    if (immediateWrite)
        mpsse_flush_output(a);

    if (debug_level>1)
        fprintf(stderr, "mpsse_setPins(sysrst=%d, led=%d, icsp=%d, icsp_oe=%d)\
                         output=%04x, direction: %04x\n",
                        sysrst, led, icsp, icsp_oe, output, direction);
}

static void mpsse_send(mpsse_adapter_t *a,
    unsigned tms_prolog_nbits, unsigned tms_prolog,
    unsigned tdi_nbits, unsigned long long tdi,
    unsigned tms_epilog_nbits, unsigned tms_epilog, int read_flag)
{

    if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)
    {
        /* Check that we have enough space in output buffer.
         * Max size of one packet is 23 bytes (6+8+3+3+3). */
        if (a->bytes_to_write > sizeof(a->output) - 23)
            mpsse_flush_output(a);

        /* Prepare a packet of MPSSE commands. */
        if (tms_prolog_nbits > 0) {
            /* Prologue TMS, from 1 to 14 bits.
             * 4b - Clock Data to TMS Pin (no Read) */
            a->output [a->bytes_to_write++] = WTMS + BITMODE + CLKWNEG + LSB;
            if (tms_prolog_nbits < 8) {
                a->output [a->bytes_to_write++] = tms_prolog_nbits - 1;
                a->output [a->bytes_to_write++] = tms_prolog;
            } else {
                a->output [a->bytes_to_write++] = 7 - 1;
                a->output [a->bytes_to_write++] = tms_prolog & 0x7f;
                a->output [a->bytes_to_write++] = WTMS + BITMODE + CLKWNEG + LSB;
                a->output [a->bytes_to_write++] = tms_prolog_nbits - 7 - 1;
                a->output [a->bytes_to_write++] = tms_prolog >> 7;
            }
        }
        if (tdi_nbits > 0) {
            /* Data, from 1 to 64 bits. */
            if (tms_epilog_nbits > 0) {
                /* Last bit should be accompanied with signal TMS=1. */
                tdi_nbits--;
            }
            unsigned nbytes = tdi_nbits / 8;
            unsigned last_byte_bits = tdi_nbits & 7;
            if (read_flag) {
                a->high_byte_bits = last_byte_bits;
                a->fix_high_bit = 0;
                a->high_byte_mask = 0;
                a->bytes_per_word = nbytes;
                if (a->high_byte_bits > 0)
                    a->bytes_per_word++;
                a->bytes_to_read += a->bytes_per_word;
            }
            if (nbytes > 0) {
                /* Whole bytes.
                 * 39 - Clock Data Bytes In and Out LSB First
                 * 19 - Clock Data Bytes Out LSB First (no Read) */
                a->output [a->bytes_to_write++] = read_flag ?
                    (WTDI + RTDO + CLKWNEG + LSB) :
                    (WTDI + CLKWNEG + LSB);
                a->output [a->bytes_to_write++] = nbytes - 1;
                a->output [a->bytes_to_write++] = (nbytes - 1) >> 8;
                while (nbytes-- > 0) {
                    a->output [a->bytes_to_write++] = tdi;
                    tdi >>= 8;
                }
            }
            if (last_byte_bits) {
                /* Last partial byte.
                 * 3b - Clock Data Bits In and Out LSB First
                 * 1b - Clock Data Bits Out LSB First (no Read) */
                a->output [a->bytes_to_write++] = read_flag ?
                    (WTDI + RTDO + BITMODE + CLKWNEG + LSB) :
                    (WTDI + BITMODE + CLKWNEG + LSB);
                a->output [a->bytes_to_write++] = last_byte_bits - 1;
                a->output [a->bytes_to_write++] = tdi;
                tdi >>= last_byte_bits;
                a->high_byte_mask = 0xffULL << (a->bytes_per_word - 1) * 8;
            }
            if (tms_epilog_nbits > 0) {
                /* Last bit (actually two bits).
                 * 6b - Clock Data to TMS Pin with Read
                 * 4b - Clock Data to TMS Pin (no Read) */
                tdi_nbits++;
                a->output [a->bytes_to_write++] = read_flag ?
                    (WTMS + RTDO + BITMODE + CLKWNEG + LSB) :
                    (WTMS + BITMODE + CLKWNEG + LSB);
                a->output [a->bytes_to_write++] = 1;
                a->output [a->bytes_to_write++] = tdi << 7 | 1 | tms_epilog << 1;
                tms_epilog_nbits--;
                tms_epilog >>= 1;
                if (read_flag) {
                    /* Last bit wil come in next byte.
                     * Compute a mask for correction. */
                    a->fix_high_bit = 0x40ULL << (a->bytes_per_word * 8);
                    a->bytes_per_word++;
                    a->bytes_to_read++;
                }
            }
            if (read_flag)
                a->high_bit_mask = 1ULL << (tdi_nbits - 1);
        }
        if (tms_epilog_nbits > 0) {
            /* Epiloque TMS, from 1 to 7 bits.
             * 4b - Clock Data to TMS Pin (no Read) */
            a->output [a->bytes_to_write++] = WTMS + BITMODE + CLKWNEG + LSB;
            a->output [a->bytes_to_write++] = tms_epilog_nbits - 1;
            a->output [a->bytes_to_write++] = tms_epilog;
        }
    }
    else{
        /* Else ICSP */
        /* If no read flag, then should be simple.
         *  -> Send two bits, change pin/OE, "read" two bits, change pin/OE
         * If there is read flag, then similar, but from 3rd bit on, read 2 bits.
         *  --> This means, we will get 2 bits of data - one TDO bit and one garbage.
         *   --> Care must be taken to extract the right one!
         *   --> (Since data is shifted LSB, the right one will be the MSB bit in the byte)
         */

        /* Check that we have enough space in output buffer.
         * Max size of one packet is roughly 123 bytes (4+1+32+2+2)*3.
         * Flush in any case, TODO optimize later */
        mpsse_flush_output(a);
        mpsse_setPins(a, 0, 1, 1, 0, 0);   /* No Reset, LED, ICSP, ICSP_OE == Output, not immediate */

        /* Enable 3-phse clocking. Without this, the data will NOT be
         * output on the proper edge! Due to this clock stretching, the speed
         * could be set a bit higher in ICSP, to compensate. */
        a->output [a->bytes_to_write++] = 0x8C;

        /* Write the TMS prologue */
        if (tms_prolog_nbits > 0)
        {
            /* Write all bits. Special case for the last one */
            for(;tms_prolog_nbits>0; tms_prolog_nbits--){
                a->output [a->bytes_to_write++] = BITMODE + LSB + CLKWNEG + WTDI; /* Write in bit mode, LSB first, on TDI, on NEGATIVE EDGE */
                a->output [a->bytes_to_write++] = 2-1;    /* Always write 2 bits - "data" and TMS. */
                a->output [a->bytes_to_write++] = (0) | ((tms_prolog & 0x01)<<1);
                tms_prolog = tms_prolog>>1;

