sergev/pic32prog/adapter-mpsse.c
                mpsse_setPins(a, 0, 1, 1, 1, 0);   /* No Reset, LED, ICSP, ICSP_OE == INPUT, not immediate */

                /* During reading, WTDI NEEDS TO BE HERE! Without it won't work properly */
                a->output [a->bytes_to_write++] = (tms_prolog_nbits == 1 && read_flag) ? 
                    (BITMODE + LSB + RTDO + CLKWNEG + WTDI) :  /* Read in bit mode, LSB first, on TDO, on POSITIVE EDGE */
                    (BITMODE + LSB + CLKWNEG + WTDI) ;         
                a->output [a->bytes_to_write++] = 2-1;    /* Always write 2 bits - dummy in this case */
                a->output [a->bytes_to_write++] = 0;
                if (tms_prolog_nbits == 1 && read_flag){
                    a->bytes_to_read++;
                }

                mpsse_setPins(a, 0, 1, 1, 0, 0);   /* No Reset, LED, ICSP, ICSP_OE == OUTPUT, not immediate */
            }
         
            
        }

        /* Write all data bits */
        if (tdi_nbits > 0){
            /* Write all bits. Special case for the last one (TMS = 1)*/
            for(;tdi_nbits>0; tdi_nbits--){
                a->output [a->bytes_to_write++] = BITMODE + LSB + CLKWNEG + WTDI; /* Write in bit mode, LSB first, on TDI, on NEGATIVE EDGE */
                a->output [a->bytes_to_write++] = 2-1;    /* Always write 2 bits - "data" and TMS. */
                a->output [a->bytes_to_write++] = (tdi & 0x01) | ((tdi_nbits == 1) ? 1 : 0)<<1;    /* Write data, then TMS. TMS is 0, except for last bit */
                tdi = tdi>>1;

                mpsse_setPins(a, 0, 1, 1, 1, 0);   /* No Reset, LED, ICSP, ICSP_OE == INPUT, not immediate */

                /* During reading, WTDI NEEDS TO BE HERE! Without it won't work properly */
                a->output [a->bytes_to_write++] = (tdi_nbits > 1 && read_flag) ? /* Don't read on last bit - we got the last bit in the previous one. */
                    (BITMODE + LSB + RTDO + CLKWNEG + WTDI) :  /* Read in bit mode, LSB first, on TDO, on POSITIVE EDGE */
                    (BITMODE + LSB + CLKWNEG + WTDI) ;
                a->output [a->bytes_to_write++] = 2-1;    /* Always write 2 bits - dummy in this case */
                a->output [a->bytes_to_write++] = 0;
                if (tdi_nbits > 1 && read_flag){
                    a->bytes_to_read++;
                }

                mpsse_setPins(a, 0, 1, 1, 0, 0);   /* No Reset, LED, ICSP, ICSP_OE == OUTPUT, not immediate */
            }
        }
    
         /* Write the TMS epilog */
        if (tms_epilog_nbits > 0)
        {
            /* Write all bits. Special case for the last one */
            for(;tms_epilog_nbits>0; tms_epilog_nbits--){
                a->output [a->bytes_to_write++] = BITMODE + LSB + CLKWNEG + WTDI; /* Write in bit mode, LSB first, on TDI, on NEGATIVE EDGE */
                a->output [a->bytes_to_write++] = 2-1;    /* Always write 2 bits - "data" and TMS. */
                a->output [a->bytes_to_write++] = (0) | ((tms_epilog & 0x01)<<1);
                tms_epilog = tms_epilog>>1;

                mpsse_setPins(a, 0, 1, 1, 1, 0);   /* No Reset, LED, ICSP, ICSP_OE == INPUT, not immediate */

                /* During reading, WTDI NEEDS TO BE HERE! Without it won't work properly */
                a->output [a->bytes_to_write++] = (BITMODE + LSB + CLKWNEG + WTDI) ; /* Just read. */
                a->output [a->bytes_to_write++] = 2-1;    /* Always write 2 bits - dummy in this case */
                a->output [a->bytes_to_write++] = 0;

                mpsse_setPins(a, 0, 1, 1, 0, 0);   /* No Reset, LED, ICSP, ICSP_OE == OUTPUT, not immediate */
            }
         
            
        }

    }
}

static unsigned long long mpsse_fix_data(mpsse_adapter_t *a, unsigned long long word)
{
    unsigned long long fix_high_bit = word & a->fix_high_bit;
    //if (debug) fprintf(stderr, "fix (%08llx) high_bit=%08llx\n", word, a->fix_high_bit);

    if (a->high_byte_bits) {
        /* Fix a high byte of received data. */
        unsigned long long high_byte = a->high_byte_mask &
            ((word & a->high_byte_mask) >> (8 - a->high_byte_bits));
        word = (word & ~a->high_byte_mask) | high_byte;
        //if (debug) fprintf(stderr, "Corrected byte %08llx -> %08llx\n", a->high_byte_mask, high_byte);
    }
    word &= a->high_bit_mask - 1;
    if (fix_high_bit) {
        /* Fix a high bit of received data. */
        word |= a->high_bit_mask;
        //if (debug) fprintf(stderr, "Corrected bit %08llx -> %08llx\n", a->high_bit_mask, word >> 9);
    }
    return word;
}

static unsigned long long mpsse_recv(mpsse_adapter_t *a)
{
    unsigned long long word;

    /* Send a packet. */
    mpsse_flush_output(a);

    /* Process a reply: one 64-bit word. */
    memcpy(&word, a->input, sizeof(word));
    if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)
        return mpsse_fix_data(a, word);
    else
        /* Else ICSP */
        return(word);
}

static uint32_t mpsse_bitReversal(uint32_t input){
    uint32_t output = 0;
    uint32_t counter = 0;
    for(counter=0; counter<32; counter++){
        if(input & (1<<counter)){
            output = output | (1<<(31-counter));
        }
    }
    return output;
}

static void mpsse_setMode(mpsse_adapter_t *a, uint32_t mode, uint32_t immediate){
    
    if (SET_MODE_TAP_RESET == mode){
        /* TMS 1-1-1-1-1-0 */
        mpsse_send(a, TMS_HEADER_RESET_TAP_NBITS, TMS_HEADER_RESET_TAP_VAL, 0, 0, 0, 0, 0);
    }
    else if (SET_MODE_EXIT == mode){
        /* TMS 1-1-1-1-1 */
        mpsse_send(a, 5, 0x1F, 0, 0, 0, 0, 0);
    }
    else if (SET_MODE_ICSP_SYNC == mode && (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface)){
        // In JTAG mode, send the MCHP key to enter ICSP on the TMS line.
		uint32_t entryCode = 0x4D434850;   // MCHP in ascii.
		entryCode = mpsse_bitReversal(entryCode);
		mpsse_send(a, 8, entryCode & 0xFF, 0, 0, 0, 0, 0);
		mpsse_send(a, 8, (entryCode >> 8) & 0xFF, 0, 0, 0, 0, 0);
		mpsse_send(a, 8, (entryCode >> 16) & 0xFF, 0, 0, 0, 0, 0);
		mpsse_send(a, 8, (entryCode >> 24) & 0xFF, 0, 0, 0, 0, 0);

