sergev/pic32prog/adapter-mpsse.c
    }
    else{
        fprintf(stderr, "mpsse_setMode called with invalid mode, quitting\n");
        exit(-1);
    }
    if (immediate){
        mpsse_flush_output(a);
    }
}

static void mpsse_sendCommand(mpsse_adapter_t *a, uint32_t command, uint32_t immediate){
    // All 5-bit commands. The 8-bit ones are command_DR, go through XferData
    if (MTAP_COMMAND != command && TAP_SW_MTAP != command       // MTAP commands
        && TAP_SW_ETAP != command && MTAP_IDCODE != command     // MTAP commands
        && ETAP_ADDRESS != command && ETAP_DATA != command      // ETAP commands
        && ETAP_CONTROL != command && ETAP_EJTAGBOOT != command // ETAP commands
        && ETAP_FASTDATA != command && ETAP_NORMALBOOT != command){ // ETAP commands
        fprintf(stderr, "mpsse_sendCommand called with invalid command 0x%02x, quitting\n", command);
        exit(-1);   // TODO make exit procedure
    }

    if (MTAP_COMMAND != command && TAP_SW_MTAP != command 
        && TAP_SW_ETAP != command && MTAP_IDCODE != command){   // MTAP commands
        mpsse_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    MTAP_COMMAND_NBITS, command,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    }
    else if (ETAP_ADDRESS != command && ETAP_DATA != command    // ETAP commands
            && ETAP_CONTROL != command && ETAP_EJTAGBOOT != command 
            && ETAP_FASTDATA != command && ETAP_NORMALBOOT != command){
        mpsse_send(a, TMS_HEADER_COMMAND_NBITS, TMS_HEADER_COMMAND_VAL,
                    ETAP_COMMAND_NBITS, command,
                    TMS_FOOTER_COMMAND_NBITS, TMS_FOOTER_COMMAND_VAL,
                    0);
    }
    if (immediate){
        mpsse_flush_output(a);
    }

}


static uint64_t mpsse_xferData(mpsse_adapter_t *a, uint32_t nBits, 
                uint32_t iData, uint32_t readFlag, uint32_t immediate){
    mpsse_send(a, TMS_HEADER_XFERDATA_NBITS, TMS_HEADER_XFERDATA_VAL,
                    nBits, iData, 
                    TMS_FOOTER_XFERDATA_NBITS, TMS_FOOTER_XFERDATA_VAL,
                    readFlag);
    if (readFlag){
        /* Flushes the output data, and returns the data */
        return mpsse_recv(a);
    }
    if (immediate){
        mpsse_flush_output(a);
    }
    return 0;
}

static uint64_t mpsse_xferFastData(mpsse_adapter_t *a, unsigned word, uint32_t readFlag, uint32_t immediate)
{
    uint64_t temp;
    mpsse_send(a, TMS_HEADER_XFERDATAFAST_NBITS, TMS_HEADER_XFERDATAFAST_VAL,
                    33, (unsigned long long) word << 1,
                    TMS_FOOTER_XFERDATAFAST_NBITS, TMS_FOOTER_XFERDATAFAST_VAL,
                    1);
    temp = mpsse_recv(a);
    if (!(temp & 0x01)){
        fprintf(stderr, "Warning: PrACC not set in xferFastData\n");
    }
    if (readFlag){
        return temp;
    }
    return 0;
}

static void mpsse_xferInstruction(mpsse_adapter_t *a, unsigned instruction)
{
    unsigned ctl;
    unsigned maxCounter = 0;

    if (debug_level > 1)
        fprintf(stderr, "%s: xfer instruction %08x\n", a->name, instruction);

    /* Select Control Register */
    mpsse_sendCommand(a, ETAP_CONTROL, 1); // ETAP_CONTROL, immediate

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        ctl = mpsse_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN 
            | CONTROL_PROBTRAP | CONTROL_EJTAGBRK), 1, 1);    // Send data, readflag, immediate don't care
        if ((! (ctl & CONTROL_PRACC))){
            fprintf(stderr, "xfer instruction, ctl was %08x\n", ctl);
            maxCounter++;
            if (maxCounter > 4){
                fprintf(stderr, "Processor still not ready. Quitting\n");
                exit(-1);   // TODO exit procedure
            }
            mdelay(1000);
        }
    } while (! (ctl & CONTROL_PRACC));

    /* Select Data Register */
    mpsse_sendCommand(a, ETAP_DATA, 1);    // ETAP_DATA, immediate

    /* Send the instruction */
    mpsse_xferData(a, 32, instruction, 0, 1);  // Send instruction, don't read, immediate

    /* Tell CPU to execute instruction */
    mpsse_sendCommand(a, ETAP_CONTROL, 1); // ETAP_CONTROL, immediate
    /* Send data. */
    mpsse_xferData(a, 32, (CONTROL_PROBEN | CONTROL_PROBTRAP), 0, 1);   // Send data, no readback, immediate
}

static void mpsse_speed(mpsse_adapter_t *a, int khz)
{
    unsigned char output [3];
    int divisor = (a->mhz * 2000 / khz + 1) / 2 - 1;

    if (divisor < 0)
        divisor = 0;
    if (debug_level)
        fprintf(stderr, "%s: divisor: %u\n", a->name, divisor);

    if (a->mhz > 6) {
        /* Use 60MHz master clock (disable divide by 5). */
        output [0] = 0x8A;

        /* Turn off adaptive clocking. */
        output [1] = 0x97;

        /* Disable three-phase clocking. */
        output [2] = 0x8D;
        bulk_write(a, output, 3);
    }

    /* Command "set TCK divisor". */
    output [0] = 0x86;
    output [1] = divisor;
    output [2] = divisor >> 8;
    bulk_write(a, output, 3);

    if (debug_level) {
        khz = (a->mhz * 2000 / (divisor + 1) + 1) / 2;
        fprintf(stderr, "%s: clock rate %.1f MHz\n", a->name, khz / 1000.0);
    }
}

static void mpsse_close(adapter_t *adapter, int power_on)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    mpsse_sendCommand(a, TAP_SW_ETAP, 1);  
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);   // Send TAP reset, immediate
    mdelay(10);

    /* Toggle /SYSRST. */
    mpsse_setPins(a, 1, 1, 0, 0, 1); // Reset, LED, no ICSP, no ICSP_OE, immediate
    mdelay(100);    /* Hold in reset for a bit, so it auto-runs afterwards */
    mpsse_setPins(a, 0, 0, 0, 0, 1); // No Reset, no LED, no ICSP, no ICSP_OE, immediate

    libusb_release_interface(a->usbdev, 0);
    libusb_close(a->usbdev);
    free(a);
}

/*
 * Read the Device Identification code
 */
static unsigned mpsse_get_idcode(adapter_t *adapter)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned idcode;

    /* Reset the JTAG TAP controller: TMS 1-1-1-1-1-0.
     * After reset, the IDCODE register is always selected.
     * Read out 32 bits of data. */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    /* Send TAP reset, immediate */
    idcode = mpsse_xferData(a, 32, 0, 1, 1);    /* Send 32 0s, receive, immediate (don't care) */
    return idcode;
}

/* Sends the special command to enter ICSP mode */
static void mpsse_enter_icsp(mpsse_adapter_t *a)
{
    uint32_t entryCode = 0x4D434850;   /* MCHP in ascii.
                                        * Data is normally sent LSB first,
                                        * so we need to bit reverse this */
	unsigned tempInterface = a->interface;	// Save, this might come in handy in JTAG too.

    entryCode = mpsse_bitReversal(entryCode);
    a->interface = INTERFACE_JTAG;  /* Sets up mpsse_send with different clocking
                                    -> Data needs to be sent on rising edge,
                                     JTAG mode does that already */
    mpsse_setPins(a, 1, 1, 1, 0, 1);  /* Reset, LED, no ICSP, ICSP_OE = Output, immediate */
    mpsse_flush_output(a);
    mdelay(10);

