sergev/pic32prog/adapter-mpsse.c
    mpsse_setPins(a, 0, 1, 1, 0, 1);  /* No Reset, LED, ICSP, ICSP_OE = Output, immediate */
    mpsse_flush_output(a);
    mdelay(10);

    mpsse_setPins(a, 1, 1, 1, 0, 1);  /* Reset, LED, ICSP, ICSP_OE = Output, immediate */
    mpsse_flush_output(a);

    mpsse_send(a, 0, 0, 32, entryCode, 0, 0, 0);    /* Send the entry code  */
    mpsse_flush_output(a);
    mdelay(10);

	if (INTERFACE_ICSP == tempInterface){
		mpsse_setPins(a, 0, 1, 1, 0, 1);  /* No Reset, LED, ICSP, ICSP_OE = Output, immediate ,
		                                ICSP selected from here on. */
	}
	else{
		mpsse_setPins(a, 0, 1, 0, 0, 1);	// Same thing as above, just no ICSP.
	}
    mpsse_flush_output(a);
    a->interface = tempInterface;  /* Sets up mpsse_send with proper clocking again */ 

}

/*
 * Put device to serial execution mode.
 */
static void serial_execution(mpsse_adapter_t *a)
{
    uint32_t counter = 2000;

    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    /* Enter serial execution. */
    if (debug_level > 0)
        fprintf(stderr, "%s: enter serial execution\n", a->name);

    /* Send command. */
    mpsse_sendCommand(a, TAP_SW_MTAP, 0);  // Command, not immediate
    /* Reset TAP */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
    /* Send command. */
    mpsse_sendCommand(a, MTAP_COMMAND, 0);
    /* Xfer data. */
    uint64_t status = mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);
    if(!(status & MCHP_STATUS_CPS)){
        fprintf(stderr, "CPS bit is SET, please erase MCU first. Status: 0x%08x\n", (uint32_t)status);
        exit(-1);
    }
    
    do{

        if (INTERFACE_ICSP == a->interface){
            mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_ASSERT_RST, 0, 1);    // Data, don't read, immediate
        }
        if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
            mpsse_setPins(a, 1, 1, 0, 0, 1);   // Reset, LED, no ICSP, no ICSP_OE, immediate
            mpsse_flush_output(a);
        }

        mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
        /* Switch to ETAP */
        mpsse_sendCommand(a, TAP_SW_ETAP, 1);   // Send command, immediate
        /* Reset TAP */
        mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
        /* Put CPU in Serial Exec Mode */
        mpsse_sendCommand(a, ETAP_EJTAGBOOT, 1); // Send command, immediate
        
        if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
            mpsse_setPins(a, 0, 1, 0, 0, 1);   // No reset, LED, no ICSP, no ICSP_OE, immediate
            mpsse_flush_output(a);
        }
        else{
            /* Else ICSP */
            /* Send command. */
            mpsse_sendCommand(a, TAP_SW_MTAP, 1);
            /* Reset TAP */
            mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
            /* Send command. */
            mpsse_sendCommand(a, MTAP_COMMAND, 1);
            /* Send command. */
            mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_DEASSERT_RST, 0, 1);
            /* Send command */ // TODO RECHECK
            mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_FLASH_ENABLE, 0, 1);
            /* Switch to ETAP */
            mpsse_sendCommand(a, TAP_SW_ETAP, 1);
            mpsse_setMode(a, SET_MODE_TAP_RESET, 1);    // Reset TAP, immediate
        }
    
        /* What is the value of ECR, after trying to connect */
        mdelay(10);
        mpsse_setMode(a, SET_MODE_TAP_RESET, 1);
        mpsse_sendCommand(a, TAP_SW_ETAP, 1);
        mpsse_setMode(a, SET_MODE_TAP_RESET, 1);
        mpsse_sendCommand(a, ETAP_CONTROL, 1);
        status = mpsse_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN | CONTROL_PROBTRAP), 1, 1);    // Send data, readflag, immediate, don't care

        if (!(status & CONTROL_PRACC)){   
            fprintf(stderr, "Failed to enter serial execution. Status was %08x\n", (uint32_t)status);
            if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){  
                /* For these chips, ICSP & JTAG pins are shared. Can do a trick */
                if (FAMILY_MX1 == a->adapter.family_name_short
                    || FAMILY_MX1 == a->adapter.family_name_short
                    || FAMILY_MM == a->adapter.family_name_short)
                {
				    fprintf(stderr, "In JTAG mode, trying to recover automatically\n");
				    // MCLR is currently 1.
				    // We need to go 0, enter ICSP, go 1, go 0, repeat this do-while loop.
				    // NOTE!! This needs to be done on the TMS LINE! TDI should be held low, probably.
				    mpsse_setPins(a, 1, 1, 0, 0, 1);   // Reset, LED, no ICSP, no ICSP_OE, immediate - immediate here means something else...
               		mpsse_flush_output(a);
				    mdelay(5);
				    
				    mpsse_setMode(a, SET_MODE_ICSP_SYNC, 1);
				    mdelay(5);

				    mpsse_setPins(a, 0, 1, 0, 0, 1);   // no Reset, LED, no ICSP, no ICSP_OE, immediate - immediate here means something else...
               		mpsse_flush_output(a);
				    mdelay(5);
                }
                else{
                    fprintf(stderr, "In JTAG mode, only recovery is through a power-cycle, or reset via ICSP. Quitting.\n");
                    exit(-1);
                }

				// Reset will be asserted in the beginning of the loop again.
								
            }
        }
        
    }while(!(status & CONTROL_PRACC) && counter-- > 1);    // Repeat, until we sucessefully enter serial execution. Extend if necessary, to more than PROBEN!
    
    if (counter == 0){
        fprintf(stderr, "Couldn't enter serial execution, quitting\n");
    }

    mdelay(10);
}

static unsigned get_pe_response(mpsse_adapter_t *a)
{
    unsigned ctl, response;

    // Select Control Register
    /* Send command. */
    mpsse_sendCommand(a, ETAP_CONTROL, 1);

    // Wait until CPU is ready
    // Check if Processor Access bit (bit 18) is set
    do {
        ctl = mpsse_xferData(a, 32, (CONTROL_PRACC | CONTROL_PROBEN 
                | CONTROL_PROBTRAP | CONTROL_EJTAGBRK), 1, 1);    // Send data, readflag, immediate don't care
    } while (! (ctl & CONTROL_PRACC));

    // Select Data Register
    // Send the instruction
    /* Send command. */
    mpsse_sendCommand(a, ETAP_DATA, 1);

