sergev/pic32prog/adapter-mpsse.c
    /* Get data. */
    response = mpsse_xferData(a, 32, 0, 1, 1);  // Send 32 zeroes, read response, immediate don't care

    // Tell CPU to execute NOP instruction
    /* Send command. */
    mpsse_sendCommand(a, ETAP_CONTROL, 1);
    /* Send data. */
    mpsse_xferData(a, 32, (CONTROL_PROBEN | CONTROL_PROBTRAP), 0, 1);

    if (debug_level > 1)
        fprintf(stderr, "%s: get PE response %08x\n", a->name, response);
    return response;
}

/*
 * Read a word from memory (without PE).
 */
static unsigned mpsse_read_word(adapter_t *adapter, unsigned addr)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned addr_lo = addr & 0xFFFF;
    unsigned addr_hi = (addr >> 16) & 0xFFFF;
    unsigned word = 0;

    /* Workaround for PIC32MM. If not in serial execution mode,
     * read byte twice after enering serial execution,
     * as first byte will be garbage. */
    unsigned times = (a->serial_execution_mode)?0:1;

    serial_execution(a);
    do{
        if (FAMILY_MX1 == a->adapter.family_name_short
                        || FAMILY_MX1 == a->adapter.family_name_short
                        || FAMILY_MK == a->adapter.family_name_short
                        || FAMILY_MZ == a->adapter.family_name_short)
        {
            //fprintf(stderr, "%s: read word from %08x\n", a->name, addr);
            mpsse_xferInstruction(a, 0x3c04bf80);            // lui s3, 0xFF20
            mpsse_xferInstruction(a, 0x3c080000 | addr_hi);  // lui t0, addr_hi
            mpsse_xferInstruction(a, 0x35080000 | addr_lo);  // ori t0, addr_lo
            mpsse_xferInstruction(a, 0x8d090000);            // lw t1, 0(t0)
            mpsse_xferInstruction(a, 0xae690000);            // sw t1, 0(s3)

            /* Send command. */
            mpsse_sendCommand(a, ETAP_FASTDATA, 1);
            /* Get fastdata. */    
            /* Send zeroes, read response, immediate don't care. Shift by 1 to get rid of PrACC */
            word = mpsse_xferFastData(a, 0, 1, 1) >> 1;
        }
        else{
            /* Else PIC32MM */
			mpsse_xferInstruction(a, 0xFF2041B3);					// lui s3, FAST_DATA_REG(32:16). Set address of fastdata register
			mpsse_xferInstruction(a, 0x000041A8 | (addr_hi<<16));	// lui t0, DATA_ADDRESS(31:16)
			mpsse_xferInstruction(a, 0x00005108 | (addr_lo<<16));	// ori t0, DATA_ADDRESS(15:0)
	 		mpsse_xferInstruction(a, 0x0000FD28);					// lw t1, 0(t0) - read data
	 		mpsse_xferInstruction(a, 0x0000F933);					// sw t1, 0(s3) - store data to fast register
			mpsse_xferInstruction(a, 0x0c000c00);					// Nop, 2x
			mpsse_xferInstruction(a, 0x0c000c00);					// Nop, 2x, again. Without this (4x nop), you will get garbage after a few bytes!
																	// Extra Nops make it even worse, always get 0s
	 		
			/* Send command. */
			mpsse_sendCommand(a, ETAP_FASTDATA, 1);

			/* Get fastdata. */
			word = mpsse_xferFastData(a, 0, 1, 1) >> 1; // Send zeroes, read response, immediate don't care. Shift by 1 to get rid of PrACC
        }

    }while(times-- > 0);

    if (debug_level > 0)
        fprintf(stderr, "%s: read word at %08x -> %08x\n", a->name, addr, word);
    return word;
}

/*
 * Read a memory block.
 */
static void mpsse_read_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned words_read, i;

    //fprintf(stderr, "%s: read %d bytes from %08x\n", a->name, nwords*4, addr);
    if (! a->use_executive) {
        /* Without PE. */
        for (; nwords > 0; nwords--) {
            *data++ = mpsse_read_word(adapter, addr);
            addr += 4;
        }
        return;
    }

    /* Use PE to read memory. */
    for (words_read = 0; words_read < nwords; words_read += 32) {

        mpsse_sendCommand(a, ETAP_FASTDATA, 1);
        mpsse_xferFastData(a, PE_READ << 16 | 32, 0, 1);       /* Read 32 words */  // Data, don't read, immediate
        mpsse_xferFastData(a, addr, 0, 1);                     /* Address */        // Data, don't read, immediate

        unsigned response = get_pe_response(a);     /* Get response */
        if (response != PE_READ << 16) {
            fprintf(stderr, "%s: bad READ response = %08x, expected %08x\n",
                a->name, response, PE_READ << 16);
            exit(-1);
        }
        for (i=0; i<32; i++) {
            *data++ = get_pe_response(a);           /* Get data */
        }
        addr += 32*4;
    }
}

/*
 * Download programming executive (PE).
 */
static void mpsse_load_executive(adapter_t *adapter,
    const unsigned *pe, unsigned nwords, unsigned pe_version)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    a->use_executive = 1;
    serial_execution(a);

    if (debug_level > 0)
        fprintf(stderr, "%s: download PE loader\n", a->name);

    /* Step 1. */
    mpsse_xferInstruction(a, 0x3c04bf88);    // lui a0, 0xbf88
    mpsse_xferInstruction(a, 0x34842000);    // ori a0, 0x2000 - address of BMXCON
    mpsse_xferInstruction(a, 0x3c05001f);    // lui a1, 0x1f
    mpsse_xferInstruction(a, 0x34a50040);    // ori a1, 0x40   - a1 has 001f0040
    mpsse_xferInstruction(a, 0xac850000);    // sw  a1, 0(a0)  - BMXCON initialized

    /* Step 2. */
    mpsse_xferInstruction(a, 0x34050800);    // li  a1, 0x800  - a1 has 00000800
    mpsse_xferInstruction(a, 0xac850010);    // sw  a1, 16(a0) - BMXDKPBA initialized

    /* Step 3. */
    mpsse_xferInstruction(a, 0x8c850040);    // lw  a1, 64(a0) - load BMXDMSZ
    mpsse_xferInstruction(a, 0xac850020);    // sw  a1, 32(a0) - BMXDUDBA initialized
    mpsse_xferInstruction(a, 0xac850030);    // sw  a1, 48(a0) - BMXDUPBA initialized

    /* Step 4. */
    mpsse_xferInstruction(a, 0x3c04a000);    // lui a0, 0xa000
    mpsse_xferInstruction(a, 0x34840800);    // ori a0, 0x800  - a0 has a0000800

    /* Download the PE loader. */
    int i;
    for (i=0; i<PIC32_PE_LOADER_LEN; i+=2) {
        /* Step 5. */
        unsigned opcode1 = 0x3c060000 | pic32_pe_loader[i];
        unsigned opcode2 = 0x34c60000 | pic32_pe_loader[i+1];

        mpsse_xferInstruction(a, opcode1);       // lui a2, PE_loader_hi++
        mpsse_xferInstruction(a, opcode2);       // ori a2, PE_loader_lo++
        mpsse_xferInstruction(a, 0xac860000);    // sw  a2, 0(a0)
        mpsse_xferInstruction(a, 0x24840004);    // addiu a0, 4
    }

