sergev/pic32prog/adapter-mpsse.c
    /* Jump to PE loader (step 6). */
    mpsse_xferInstruction(a, 0x3c19a000);    // lui t9, 0xa000
    mpsse_xferInstruction(a, 0x37390800);    // ori t9, 0x800  - t9 has a0000800
    mpsse_xferInstruction(a, 0x03200008);    // jr  t9
    mpsse_xferInstruction(a, 0x00000000);    // nop

    /* Switch from serial to fast execution mode. */
    mpsse_sendCommand(a, TAP_SW_ETAP, 1);
    /* TMS 1-1-1-1-1-0 */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);

    /* Send parameters for the loader (step 7-A).
     * PE_ADDRESS = 0xA000_0900,
     * PE_SIZE */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1);
    mpsse_xferFastData(a, 0xa0000900, 0, 1);    /* Don't read, immediate */
    mpsse_xferFastData(a, nwords, 0, 1);        /* Don't read, immediate */

    /* Download the PE itself (step 7-B). */
    if (debug_level > 0)
        fprintf(stderr, "%s: download PE\n", a->name);
    for (i=0; i<nwords; i++) {
        mpsse_xferFastData(a, *pe++, 0, 0);     /* Don't read, not immediate */
    }
    mpsse_flush_output(a);
    mdelay(10);

    /* Download the PE instructions. */
    /* Step 8 - jump to PE. */
    mpsse_xferFastData(a, 0, 0, 1);             /* Don't read, immediate */                  
    mpsse_xferFastData(a, 0xDEAD0000, 0, 1);    /* Don't read, immediate */
    mdelay(10);
    mpsse_xferFastData(a, PE_EXEC_VERSION << 16, 0, 1); /* Don't read, immediate */

    unsigned version = get_pe_response(a);
    if (version != (PE_EXEC_VERSION << 16 | pe_version)) {
        fprintf(stderr, "%s: bad PE version = %08x, expected %08x\n",
            a->name, version, PE_EXEC_VERSION << 16 | pe_version);
        exit(-1);
    }
    if (debug_level > 0)
        fprintf(stderr, "%s: PE version = %04x\n",
            a->name, version & 0xffff);
}

/*
 * Erase all flash memory.
 */
static void mpsse_erase_chip(adapter_t *adapter)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned status = 0;

    /* Switch to MTAP */
    mpsse_sendCommand(a, TAP_SW_MTAP, 1);
    /* Reset TAP */
    mpsse_setMode(a, SET_MODE_TAP_RESET, 1);
    /* Send command. */
    mpsse_sendCommand(a, MTAP_COMMAND, 1);
    /* Xfer data. */
    mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_ERASE, 0, 1);
    mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_DEASSERT_RST, 0, 1);

    // https://www.microchip.com/forums/m627418.aspx .......
    if (INTERFACE_JTAG == a->interface || INTERFACE_DEFAULT == a->interface){
        mpsse_setPins(a, 0, 1, 0, 0, 1);  /* No Reset, LED, no ICSP, no ICSP_OE, immediate */
    }

    do{
        status = mpsse_xferData(a, MTAP_COMMAND_DR_NBITS, MCHP_STATUS, 1, 1);  // Send data, read response, immediate don't care
        //fprintf(stderr, "Status is 0x%08x ... \n", statuss);
        if (!(status & MCHP_STATUS_CFGRDY) || (status & MCHP_STATUS_FCBUSY)){
            printf(".");
            mdelay(10);
        }
    }while(!(status & MCHP_STATUS_CFGRDY) || (status & MCHP_STATUS_FCBUSY));

    mpsse_setMode(a, SET_MODE_TAP_RESET, 1); 
    mdelay(25);
}

/*
 * Write a word to flash memory.
 */
static void mpsse_program_word(adapter_t *adapter,
    unsigned addr, unsigned word)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;

    if (debug_level > 0)
        fprintf(stderr, "%s: program word at %08x: %08x\n", a->name, addr, word);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1);

    mpsse_xferFastData(a, PE_WORD_PROGRAM << 16 | 2, 0, 1); // Data, don't read, immediate
    mpsse_xferFastData(a, addr, 0, 1);  /* Send address. */ // Data, don't read, immediate
    mpsse_xferFastData(a, word, 0, 1);  /* Send word. */    // Data, don't read, immediate

    unsigned response = get_pe_response(a);
    if (response != (PE_WORD_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program word %08x at %08x, reply = %08x\n",
            a->name, word, addr, response);
        exit(-1);
    }
}

/*
 * Flash write row of memory.
 */
static void mpsse_program_row(adapter_t *adapter, unsigned addr,
    unsigned *data, unsigned words_per_row)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    int i;

    if (debug_level > 0)
        fprintf(stderr, "%s: row program %u words at %08x\n",
            a->name, words_per_row, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow flash write not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to write flash memory. */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1); 

    mpsse_xferFastData(a, PE_ROW_PROGRAM << 16 | words_per_row, 0, 1);  // Data, don't read, immediate
    mpsse_xferFastData(a, addr, 0, 1);  /* Send address. */             // Data, don't read, immediate

    /* Download data. */
    for (i = 0; i < words_per_row; i++) {
        if ((i & 7) == 0)
            mpsse_flush_output(a);
        mpsse_xferFastData(a, *data++, 0, 0);   /* Send word. Don't read, not immediate */
    }
    mpsse_flush_output(a);

    unsigned response = get_pe_response(a);
    if (response != (PE_ROW_PROGRAM << 16)) {
        fprintf(stderr, "%s: failed to program row at %08x, reply = %08x\n",
            a->name, addr, response);
        exit(-1);
    }
}

/*
 * Verify a block of memory.
 */
static void mpsse_verify_data(adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    mpsse_adapter_t *a = (mpsse_adapter_t*) adapter;
    unsigned data_crc, flash_crc;

    //fprintf(stderr, "%s: verify %d words at %08x\n", a->name, nwords, addr);
    if (! a->use_executive) {
        /* Without PE. */
        fprintf(stderr, "%s: slow verify not implemented yet.\n", a->name);
        exit(-1);
    }

    /* Use PE to get CRC of flash memory. */
    /* Send command. */
    mpsse_sendCommand(a, ETAP_FASTDATA, 1);

    mpsse_xferFastData(a, PE_GET_CRC << 16, 0, 1);  // Data, don't read, immediate
     /* Send address. */
    mpsse_xferFastData(a, addr, 0, 1);              // Data, don't read, immediate
    /* Send length. */
    mpsse_xferFastData(a, nwords * 4, 0, 1);        // Data, don't read, immediate

    unsigned response = get_pe_response(a);
    if (response != (PE_GET_CRC << 16)) {
        fprintf(stderr, "%s: failed to verify %d words at %08x, reply = %08x\n",
            a->name, nwords, addr, response);
        exit(-1);
    }
    flash_crc = get_pe_response(a) & 0xffff;

    data_crc = calculate_crc(0xffff, (unsigned char*) data, nwords * 4);
    if (flash_crc != data_crc) {
        fprintf(stderr, "%s: checksum failed at %08x: sum=%04x, expected=%04x\n",
            a->name, addr, flash_crc, data_crc);
        //exit(-1);
    }
}

